Revit 2024 API
LightFamily.GetLightFamily Method
 Creates a light family object from the given family document
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public static LightFamily GetLightFamily(
	Document document
)
Visual Basic
Public Shared Function GetLightFamily ( _
	document As Document _
) As LightFamily
Visual C++
public:
static LightFamily^ GetLightFamily(
	Document^ document
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The family document
Return Value
 The newly created LightFamily object
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The Document is the argument that is being validated The document is not valid because it is not a light family document.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
LightFamily Class
Autodesk.Revit.DB.Lighting Namespace